print('Hello world!')
while True:
    a = input('Введіть повідомлення: ')
    if not a:
        print('Ви нічого не ввели!')
    else:
        print('Ви ввели:', a)
        break

age = input('Введіть свій вік: ')

if not age:
    print('Ви нічого не ввели!')
else:
    if int(age) < 18:
        print('Неповнолітній')
    else:
        print('Повнолітній')


'''

    Написати програму, яка просить користувача ввести своє ім'я,
    після чого відає його по імені.
    
    Наприклад:
    
    Як тебе звуть? Андрій
    Привіт, Андрій!
    
    a = input('Як тебе звуть? ')
    print('Привіт,', a, '!')
    
    Програма має запитати вік користувача, після чого вивести "повнолітній", якщо
    вік дорівнює 18 або більше, або вивести "неповнолітній", якщо вік меньше за 18.
    
    Скільки тобі років? 17
    Неповнолітній
'''